# Import and dataset loading

In [1]:
import pandas as pd
import numpy as np

In [2]:
A = pd.DataFrame({
    'transport': ['Machine', 'Ship', 'Airplane', 'Train'],
    'avg_speed': ['80', '92', '210', '102']
})

A

  transport avg_speed
0   Machine        80
1      Ship        92
2  Airplane       210
3     Train       102

In [7]:
B = pd.DataFrame({
    'transport': ['Machine', 'Ship', 'Airplane', 'Trainway'],
    'avg_price': ['32000', '54000', '180000', '23000']
})

B

  transport avg_price
0   Machine     32000
1      Ship     54000
2  Airplane    180000
3  Trainway     23000

# Join with match columns

### INNER JOIN

In [8]:
C = pd.merge(A, B)

C

  transport avg_speed avg_price
0   Machine        80     32000
1      Ship        92     54000
2  Airplane       210    180000

### OUTER JOIN

In [9]:
D = pd.merge(A, B, how='outer')

D

  transport avg_speed avg_price
0   Machine        80     32000
1      Ship        92     54000
2  Airplane       210    180000
3     Train       102       NaN
4  Trainway       NaN     23000

### LEFT JOIN

In [10]:
E = pd.merge(A, B, how='left')

E

  transport avg_speed avg_price
0   Machine        80     32000
1      Ship        92     54000
2  Airplane       210    180000
3     Train       102       NaN

### RIGHT JOIN

In [11]:
F = pd.merge(A, B, how='right')

F

  transport avg_speed avg_price
0   Machine        80     32000
1      Ship        92     54000
2  Airplane       210    180000
3  Trainway       NaN     23000

# Join with different columns

In [13]:
A.columns = ['transport_type', 'avg_speed']

A

  transport_type avg_speed
0        Machine        80
1           Ship        92
2       Airplane       210
3          Train       102

In [14]:
B

  transport avg_price
0   Machine     32000
1      Ship     54000
2  Airplane    180000
3  Trainway     23000

In [16]:
G = pd.merge(A, B, left_on='transport_type', right_on='transport')

G

  transport_type avg_speed transport avg_price
0        Machine        80   Machine     32000
1           Ship        92      Ship     54000
2       Airplane       210  Airplane    180000

# Join with indexes

In [19]:
A.set_index('transport_type', inplace=True)

In [23]:
B.set_index('transport', inplace=True)

In [25]:
pd.merge(A, B, left_index=True, right_index=True)

         avg_speed avg_price
Machine         80     32000
Ship            92     54000
Airplane       210    180000

# Join with index and column

In [26]:
B = pd.DataFrame({
    'transport': ['Machine', 'Ship', 'Airplane', 'Trainway'],
    'avg_price': ['32000', '54000', '180000', '23000']
})

B

  transport avg_price
0   Machine     32000
1      Ship     54000
2  Airplane    180000
3  Trainway     23000

In [27]:
A

               avg_speed
transport_type
Machine               80
Ship                  92
Airplane             210
Train                102

In [28]:
pd.merge(A, B, left_index=True, right_on='transport')

  avg_speed transport avg_price
0        80   Machine     32000
1        92      Ship     54000
2       210  Airplane    180000